---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetTransparency(System.Double)
source: html/6866ee5e-23ea-9b05-a6f4-74ba3795b81d.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetTransparency Method

Sets the transparency parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetTransparency(
	double transparency
)
```

## Parameters
- **transparency** (`System.Double`) - The transparency value.